Repository: deiga/Geen-Dog
Catalog: locale/*/LC_MESSAGES/roydon.po
Languages: fi_fi

# header.subtitle
source: Kennelaccessories
fi_fi: Kenneltarvikkeet

# contact.title
source: Our contact information
fi_fi: Meihin saat yhteyden

# contact.general
source: General questions
fi_fi: Yleiset kysymykset

# contact.products
source: Product, availability and price questions
fi_fi: Tuote-, saatavuus- ja hintakyselyt

# contact.web
source: Questions and comments regarding the web page
fi_fi: Sivuihin liittyvät kysymykset ja kommentit

# contact.mail
source: By mail
fi_fi: Postitse

# contact.phone
source: By phone
fi_fi: Puhelimella

# show.next.title
source: You can find us next in
fi_fi: Seuraavaksi löydät meidät

# show.next.more
source: More dog shows
fi_fi: Lisää näyttelyitä

# links.title
source: Links
fi_fi: Linkkejä

# show.title
source: You can find us at these dow shows in
fi_fi: Seuraavista näyttelyistä löydät meidät vuonna

# show.time
source: Time
fi_fi: Aika

# show.name
source: Name
fi_fi: Nimi

# show.location
source: Place
fi_fi: Paikka

# product.title
source: Products
fi_fi: Tuotteet

# navi.home
source: Homepage
fi_fi: Etusivu

# navi.shows
source: Dog shows
fi_fi: Näyttelyt

# navi.contact
source: Contact Us
fi_fi: Ota Yhteyttä

# lang.text
source: Suomeksi
fi_fi: In English

# news.title
source: News
fi_fi: Uutiset

# news.more
source: More
fi_fi: Lisää

# links.kennelclub
source: Finnish Kennel Club
fi_fi: Suomen Kennelliitto

# links.airedale
source: Finnish Airedale Terrier Club
fi_fi: Suomen Airedalenterrieriyhdistys

# links.terriers
source: Finnish Terrier Club
fi_fi: Suomen Terrierijärjestö Ry

# links.lakeland
source: Finnish Lakeland Terrier Club
fi_fi: Lakelandinterrieri Ry

# show.more.info
source: Additional information about finnsih dog shows
fi_fi: Lisätietoja suomen koiranäyttelyistä

# footer.admin
source: Administration
fi_fi: Ylläpito
